Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv3d (Conv3D)              (None, 5, 200, 200, 100)  12600     
_________________________________________________________________
max_pooling3d (MaxPooling3D) (None, 5, 100, 100, 100)  0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 5, 50, 50, 150)    1875150   
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 5, 25, 25, 150)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 1, 25, 25, 150)    2812650   
_________________________________________________________________
dense (Dense)                (None, 1, 25, 25, 600)    90600     
_________________________________________________________________
dense_1 (Dense)              (None, 1, 25, 25, 600)    360600    
_________________________________________________________________
conv3d_transpose (Conv3DTran (None, 1, 50, 50, 150)    11250150  
_________________________________________________________________
batch_normalization (BatchNo (None, 1, 50, 50, 150)    600       
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 1, 100, 100, 100)  1875100   
_________________________________________________________________
batch_normalization_1 (Batch (None, 1, 100, 100, 100)  400       
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 1, 200, 200, 100)  1250100   
_________________________________________________________________
batch_normalization_2 (Batch (None, 1, 200, 200, 100)  400       
_________________________________________________________________
conv3d_transpose_3 (Conv3DTr (None, 1, 600, 600, 100)  1250100   
_________________________________________________________________
batch_normalization_3 (Batch (None, 1, 600, 600, 100)  400       
_________________________________________________________________
dense_2 (Dense)              (None, 1, 600, 600, 800)  80800     
_________________________________________________________________
dense_3 (Dense)              (None, 1, 600, 600, 1)    801       
=================================================================
Total params: 20,860,451
Trainable params: 20,859,551
Non-trainable params: 900
_________________________________________________________________
