Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv3d_3 (Conv3D)            (None, 5, 200, 200, 100)  12600     
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 5, 100, 100, 100)  0         
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 5, 50, 50, 150)    1875150   
_________________________________________________________________
max_pooling3d_4 (MaxPooling3 (None, 5, 25, 25, 150)    0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 5, 25, 25, 150)    2812650   
_________________________________________________________________
max_pooling3d_5 (MaxPooling3 (None, 1, 25, 25, 150)    0         
_________________________________________________________________
dense_4 (Dense)              (None, 1, 25, 25, 600)    90600     
_________________________________________________________________
dense_5 (Dense)              (None, 1, 25, 25, 600)    360600    
_________________________________________________________________
conv3d_transpose_4 (Conv3DTr (None, 1, 50, 50, 150)    11250150  
_________________________________________________________________
batch_normalization_4 (Batch (None, 1, 50, 50, 150)    600       
_________________________________________________________________
conv3d_transpose_5 (Conv3DTr (None, 1, 100, 100, 100)  1875100   
_________________________________________________________________
batch_normalization_5 (Batch (None, 1, 100, 100, 100)  400       
_________________________________________________________________
conv3d_transpose_6 (Conv3DTr (None, 1, 200, 200, 100)  1250100   
_________________________________________________________________
batch_normalization_6 (Batch (None, 1, 200, 200, 100)  400       
_________________________________________________________________
conv3d_transpose_7 (Conv3DTr (None, 1, 600, 600, 100)  1250100   
_________________________________________________________________
batch_normalization_7 (Batch (None, 1, 600, 600, 100)  400       
_________________________________________________________________
dense_6 (Dense)              (None, 1, 600, 600, 800)  80800     
_________________________________________________________________
dense_7 (Dense)              (None, 1, 600, 600, 1)    801       
=================================================================
Total params: 20,860,451
Trainable params: 20,859,551
Non-trainable params: 900
_________________________________________________________________
